python/bottle/ab-gunicorn.out
ab -n 500 -c 50 http://localhost:8080/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        gunicorn/0.17.4
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        130 bytes

Concurrency Level:      50
Time taken for tests:   0.099 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      145500 bytes
HTML transferred:       65000 bytes
Requests per second:    5047.34 [#/sec] (mean)
Time per request:       9.906 [ms] (mean)
Time per request:       0.198 [ms] (mean, across all concurrent requests)
Transfer rate:          1434.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.4      0       5
Processing:     1    9   1.8      8      17
Waiting:        1    8   1.8      8      17
Total:          6    9   2.1      8      22

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     10
  90%     11
  95%     13
  98%     17
  99%     17
 100%     22 (longest request)